inblat/STM32_FOC_ACIM/src/MC_Keys.c
/*******************************************************************************
* Function Name  : KEYS_process
* Description    : Process key 
* Input          : Key code
* Output         : None
* Return         : None
*******************************************************************************/

void KEYS_process(void)
{
bKey = KEYS_Read();    // read key pushed (if any...)

switch (bMenu_index)
      {        
        case(CONTROL_MODE_MENU_1):
          switch(bKey)
          {
            case UP:
            case DOWN:
              wGlobal_Flags ^= CLOSED_LOOP;
              PID_Init(&PID_Torque_InitStructure, &PID_Flux_InitStructure, &PID_Speed_InitStructure);
              bMenu_index = CONTROL_MODE_MENU_6;
            break;
            
            case RIGHT:
                bMenu_index = REF_SPEED_MENU;
            break;
            
            case LEFT:
#ifdef DAC_FUNCTIONALITY              
              bMenu_index = DAC_PB1_MENU;
#else
              bMenu_index = POWER_STAGE_MENU;
#endif
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
              else if (State== START)
              {
                State = STOP; 
              }
                else if(State == IDLE)
                {
                  State = INIT;
                  bMenu_index = REF_SPEED_MENU;
                }  
              
            break;
            default:
            break;
          }
        break;
        
        case(REF_SPEED_MENU):
          switch(bKey)
          {
            case UP:
              if (hSpeed_Reference <= MAX_FREQ)
              {
                hSpeed_Reference += SPEED_INC_DEC;
              }
            break;
              
            case DOWN:
              if (hSpeed_Reference >= -MAX_FREQ)
              {
                hSpeed_Reference -= SPEED_INC_DEC;
              }
            break;
           
            case RIGHT:
                bMenu_index = P_SPEED_MENU;
            break;

            case LEFT:
              if (State == IDLE)
              {
                bMenu_index = CONTROL_MODE_MENU_1;
              }
              else
              {
#ifdef DAC_FUNCTIONALITY              
              bMenu_index = DAC_PB1_MENU;
#else              
              bMenu_index = POWER_STAGE_MENU;
#endif
              }              
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
              else if(State == START)
              {
                State = STOP;
              }              
                else if(State == IDLE)
                {
                  State = INIT;
                }   
            break;
            default:
            break;
          }
        break;          
        
        case(P_SPEED_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Speed_InitStructure.hKp_Gain <= 32500)
              {
                PID_Speed_InitStructure.hKp_Gain += hKp_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Speed_InitStructure.hKp_Gain >= hKp_Gain_INC_DEC)
              {
              PID_Speed_InitStructure.hKp_Gain -= hKp_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:
                bMenu_index = I_SPEED_MENU;
            break;

            case LEFT:
                bMenu_index = REF_SPEED_MENU;             
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
              else if (State== START)
              {
                State = STOP; 
              }
                else if(State == IDLE)
                {
                  State = INIT;
                }   
            break;
          default:
            break;
          }
        break;

        case(I_SPEED_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Speed_InitStructure.hKi_Gain <= 32500)
              {
                PID_Speed_InitStructure.hKi_Gain += hKi_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Speed_InitStructure.hKi_Gain >= hKi_Gain_INC_DEC)
              {
              PID_Speed_InitStructure.hKi_Gain -= hKi_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:
#ifdef DIFFERENTIAL_TERM_ENABLED                 
                bMenu_index = D_SPEED_MENU;
#else
                bMenu_index = P_TORQUE_MENU;
#endif                
            break;

            case LEFT:
              bMenu_index = P_SPEED_MENU;
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
              else if (State== START)
              {
                State = STOP; 
              }
                else if(State == IDLE)
                {
                  State = INIT;
                }   
            break;
          default:
            break;
          }
        break;        
        
#ifdef DIFFERENTIAL_TERM_ENABLED       
        case(D_SPEED_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Speed_InitStructure.hKd_Gain <= 32500)
              {
                PID_Speed_InitStructure.hKd_Gain += hKd_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Speed_InitStructure.hKd_Gain >= hKd_Gain_INC_DEC)
              {
              PID_Speed_InitStructure.hKd_Gain -= hKd_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:                
                bMenu_index = P_TORQUE_MENU;               
            break;
            
            case LEFT:
              bMenu_index = I_SPEED_MENU;
            break;
            
            case SEL:
              if (State == RUN || State == START)
              {
                State = STOP;               
              }
              else if(State == IDLE)
              {
                State = INIT;
              }   
            break;
          default:
            break;
          }
        break;   
#endif
        case(P_TORQUE_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Torque_InitStructure.hKp_Gain <= 32500)
              {
                PID_Torque_InitStructure.hKp_Gain += hKp_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Torque_InitStructure.hKp_Gain >= hKp_Gain_INC_DEC)
              {
              PID_Torque_InitStructure.hKp_Gain -= hKp_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:
                bMenu_index = I_TORQUE_MENU;
            break;
             
            case LEFT:         
              if ((wGlobal_Flags & CLOSED_LOOP) == CLOSED_LOOP)
              {
#ifdef DIFFERENTIAL_TERM_ENABLED              
                bMenu_index = D_SPEED_MENU;
#else
                bMenu_index = I_SPEED_MENU; 
#endif                
              }
              else
              {
                bMenu_index = ID_REF_MENU;
              }              
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
              else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                  }   
            break;
          default:
            break;
          }
        break;
        
        case(I_TORQUE_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Torque_InitStructure.hKi_Gain <= 32500)
              {
                PID_Torque_InitStructure.hKi_Gain += hKi_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Torque_InitStructure.hKi_Gain >= hKi_Gain_INC_DEC)
              {
              PID_Torque_InitStructure.hKi_Gain -= hKi_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:
#ifdef DIFFERENTIAL_TERM_ENABLED                 
                bMenu_index = D_TORQUE_MENU;
#else
                bMenu_index = P_FLUX_MENU;
#endif                
            break;

            case LEFT:
              bMenu_index = P_TORQUE_MENU;
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
                else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                  }   
            break;
          default:
            break;
          }
        break;
        
#ifdef DIFFERENTIAL_TERM_ENABLED       
        case(D_TORQUE_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Torque_InitStructure.hKd_Gain <= 32500)
              {
                PID_Torque_InitStructure.hKd_Gain += hKd_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Torque_InitStructure.hKd_Gain >= hKd_Gain_INC_DEC)
              {
              PID_Torque_InitStructure.hKd_Gain -= hKd_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:                
                bMenu_index = P_FLUX_MENU;               
            break;
            
            case LEFT:
              bMenu_index = I_TORQUE_MENU;
            break;
            
            case SEL:
              if (State == RUN || State == START)
              {
                State = STOP;               
              }
              else if(State == IDLE)
              {
                State = INIT;
              }   
            break;
          default:
            break;
          }
        break;   
#endif 
        case(P_FLUX_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Flux_InitStructure.hKp_Gain <= 32500)
              {
                PID_Flux_InitStructure.hKp_Gain += hKp_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Flux_InitStructure.hKp_Gain >= hKp_Gain_INC_DEC)
              {
                PID_Flux_InitStructure.hKp_Gain -= hKp_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:
                bMenu_index = I_FLUX_MENU;
            break;
             
            case LEFT:         
#ifdef  DIFFERENTIAL_TERM_ENABLED
              bMenu_index = D_TORQUE_MENU;
#else
              bMenu_index = I_TORQUE_MENU;
#endif              
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
                else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                  }   
            break;
          default:
            break;
          }
        break;
        
