inblat/STM32_FOC_ACIM/src/MC_Keys.c
        case(I_FLUX_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Flux_InitStructure.hKi_Gain <= 32500)
              {
                PID_Flux_InitStructure.hKi_Gain += hKi_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Flux_InitStructure.hKi_Gain >= hKi_Gain_INC_DEC)
              {
              PID_Flux_InitStructure.hKi_Gain -= hKi_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:
#ifdef DIFFERENTIAL_TERM_ENABLED                 
                bMenu_index = D_FLUX_MENU;
#else
                bMenu_index = POWER_STAGE_MENU;
#endif                
            break;

            case LEFT:
              bMenu_index = P_FLUX_MENU;
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
                else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                  }   
            break;
          default:
            break;
          }
        break;
        
#ifdef DIFFERENTIAL_TERM_ENABLED       
        case(D_FLUX_MENU):    
          switch(bKey)
          {
            case UP:
              if (PID_Flux_InitStructure.hKd_Gain <= 32500)
              {
                PID_Flux_InitStructure.hKd_Gain += hKd_Gain_INC_DEC;
              }
            break;
              
            case DOWN:
              if (PID_Flux_InitStructure.hKd_Gain >= hKd_Gain_INC_DEC)
              {
              PID_Flux_InitStructure.hKd_Gain -= hKd_Gain_INC_DEC;
              }
            break;
           
            case RIGHT:                
                bMenu_index = POWER_STAGE_MENU;               
            break;
            
            case LEFT:              
              bMenu_index = I_FLUX_MENU;
            break;
            
            case SEL:
              if (State == RUN || State == START)
              {
                State = STOP;               
              }
              else if(State == IDLE)
              {
                State = INIT;
              }   
            break;
          default:
            break;
          }
        break;   
#endif 
        case(POWER_STAGE_MENU):
          switch(bKey)
          {
            case RIGHT:       

#ifdef DAC_FUNCTIONALITY
              bMenu_index = DAC_PB0_MENU;
#else 
              if ((wGlobal_Flags & CLOSED_LOOP == CLOSED_LOOP))
              {
                if (State == IDLE)
                {
                  bMenu_index = CONTROL_MODE_MENU_1;
                }
                else
                {
                  bMenu_index = REF_SPEED_MENU;
                }
              }
              else //Open Loop
              {
                if (State == IDLE)
                {
                  bMenu_index = CONTROL_MODE_MENU_6;
                }
                else
                {
                  bMenu_index = IQ_REF_MENU;
                }
              }
#endif  
            break;
            
            case LEFT:
#ifdef DIFFERENTIAL_TERM_ENABLED            
              bMenu_index = D_FLUX_MENU;
#else
              bMenu_index = I_FLUX_MENU;                          
#endif              
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
                else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                  }   
            break;
          default:
            break;
          }
        break; 
        
        case(CONTROL_MODE_MENU_6):
          switch(bKey)
          {
            case UP:
            case DOWN:
              wGlobal_Flags ^= CLOSED_LOOP;
              bMenu_index = CONTROL_MODE_MENU_1;
            break;
            
            case RIGHT:
                bMenu_index = IQ_REF_MENU;
            break;
            
            case LEFT:
#ifdef DAC_FUNCTIONALITY              
              bMenu_index = DAC_PB1_MENU;
#else              
              bMenu_index = POWER_STAGE_MENU;
#endif 
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
                else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                    bMenu_index = IQ_REF_MENU;
                  }   
            break;
            default:
            break;
          }
        break;  
        
        case(IQ_REF_MENU):
          switch(bKey)
          {
            case UP:
              if (hTorque_Reference <= NOMINAL_TORQUE-TORQUE_INC_DEC)
              {
                hTorque_Reference += TORQUE_INC_DEC;
              }
            break;
            
            case DOWN:
            if (hTorque_Reference >= -NOMINAL_TORQUE + TORQUE_INC_DEC)
            {
              hTorque_Reference -= TORQUE_INC_DEC;
            }
            break;
            
            case RIGHT:
                bMenu_index = ID_REF_MENU;
            break;
            
            case LEFT:
              if(State == IDLE)
              {
                bMenu_index = CONTROL_MODE_MENU_6;
              }
              else
              {
#ifdef DAC_FUNCTIONALITY              
              bMenu_index = DAC_PB1_MENU;
#else              
              bMenu_index = POWER_STAGE_MENU;
#endif 
              }
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
                else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                  }   
            break;
            default:
            break;
          }
        break;    
        
        case(ID_REF_MENU):
          switch(bKey)
          {
            case UP:
              if (hFlux_Reference <= NOMINAL_FLUX-FLUX_INC_DEC)
              {
                hFlux_Reference += FLUX_INC_DEC;
              }
            break;
            
            case DOWN:
              if (hFlux_Reference >= FLUX_INC_DEC)
              {
                hFlux_Reference -= FLUX_INC_DEC;
              }
            break;
            
            case RIGHT:
              bMenu_index = P_TORQUE_MENU;
            break;
            
            case LEFT:
              bMenu_index = IQ_REF_MENU;
            break;
            
            case SEL:
              if (State == RUN)
              {
                State = STOP;               
              }
                else if (State== START)
                {
                  State = STOP; 
                }
                  else if(State == IDLE)
                  {
                    State = INIT;
                  }   
            break;
            default:
            break;
          }
        break;

#ifdef DAC_FUNCTIONALITY  
        case(DAC_PB0_MENU):    
          switch(bKey)
          {
            case UP:
              MCDAC_Output_Choice(1,DAC_CH1);
            break;
            
            case DOWN:
              MCDAC_Output_Choice(-1,DAC_CH1);
            break;  
           
            case RIGHT:                
                bMenu_index = DAC_PB1_MENU;               
            break;
            
            case LEFT:
              bMenu_index = POWER_STAGE_MENU;
            break;
            
            case SEL:
              if (State == RUN || State == START)
              {
                State = STOP;               
              }
              else if(State == IDLE)
              {
                State = INIT;
              }   
            break;
          default:
            break;
          }
        break;   

        case(DAC_PB1_MENU):    
          switch(bKey)
          {
            case UP:
              MCDAC_Output_Choice(1,DAC_CH2);
            break;
            
            case DOWN:
              MCDAC_Output_Choice(-1,DAC_CH2);
            break;  
           
            case RIGHT:                
            if ((wGlobal_Flags & CLOSED_LOOP == CLOSED_LOOP))
              {
                if (State == IDLE)
                {
                  bMenu_index = CONTROL_MODE_MENU_1;
                }
                else
                {
                  bMenu_index = REF_SPEED_MENU;
                }
              }
              else //Open Loop
              {
                if (State == IDLE)
                {
                  bMenu_index = CONTROL_MODE_MENU_6;
                }
                else
                {
                  bMenu_index = IQ_REF_MENU;
                }
              }               
            break;
            
            case LEFT:             
              bMenu_index = DAC_PB0_MENU;
            break;
            
            case SEL:
              if (State == RUN || State == START)
              {
                State = STOP;               
              }
              else if(State == IDLE)
              {
                State = INIT;
              }   
            break;
          default:
            break;
          }
        break; 
#endif 
      default:
        break; 
      }
}

/*******************************************************************************
* Function Name  : KEYS_ExportbKey
* Description    : Export bKey variable
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
u8 KEYS_ExportbKey(void)
{
  return(bKey);
}
                   
/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/

